from django import forms
from .models import *


class RegistrationBPLAForm(forms.ModelForm):
    class Meta:
        model = Bas
        # types = (
        #     ("С жестким крылом", "С жестким крылом"),
        #     ("С гибким крылом", "С гибким крылом"),
        #     ("С вращающимся крылом", "С вращающимся крылом"),
        #     ("С машущим крылом", "С машущим крылом"),
        #     ("Аэростатические", "Аэростатические")
        # )
        #
        # classifications = (
        #     ("Микро-мини", "Микро-мини"),
        #     ("Лёгкий малого радиуса", "Лёгкий малого радиуса"),
        #     ("Лёгкий среднего радиуса", "Лёгкий среднего радиуса"),
        #     ("Средний", "Средний"),
        #     ("Средне-тяжелый", "Средне-тяжелый"),
        #     ("Тяжелый среднего радиуса", "Тяжелый среднего радиуса"),
        #     ("Тяжелый с продолжительным полетом", "Тяжелый с продолжительным полетом"),
        #     ("Боевой", "Боевой")
        # )
        #
        # verify = (
        #     ("На проверке", "На проверке"),
        #     ("Верифирован", "Верифирован"),
        #     ("Отказ", "Отказ")
        # )

        fields = [
            "type",
            "classification",
            "weight",
            "photo"
        ]

        # widgets = {
        #     "type":   forms.Select(choices = types),
        #     "classification":  forms.Select(choices = classifications),
        #     "weight": forms.NumberInput(),
        #     "photo":  forms.ImageField(),
        # }
